{"data":{"doc":{"path":"/docs/jamstack","title":"What is the JAMstack?","content":"<h1 id=\"what-is-the-jamstack\"><a href=\"#what-is-the-jamstack\" aria-hidden=\"true\">#</a>What is the JAMstack?</h1>\n<blockquote>\n<p>JAMstack is a new way of building websites and apps that delivers better performance, higher security, lower cost of scaling, and a better developer experience. It's a Modern web development architecture based on client-side JavaScript, reusable APIs, and prebuilt Markup.</p>\n</blockquote>\n<h2 id=\"benefits\"><a href=\"#benefits\" aria-hidden=\"true\">#</a>Benefits</h2>\n<h3 id=\"️-better-performance\"><a href=\"#%EF%B8%8F-better-performance\" aria-hidden=\"true\">#</a>⚡️ Better Performance</h3>\n<p>Why wait for pages to build on the fly when you can generate them at deploy time? When it comes to minimizing the time to first byte, nothing beats pre-built files served over a CDN.</p>\n<h3 id=\"️-higher-security\"><a href=\"#%EF%B8%8F-higher-security\" aria-hidden=\"true\">#</a>⚡️ Higher Security</h3>\n<p>With server-side processes abstracted into microservice APIs, surface areas for attacks are reduced. You can also leverage the domain expertise of specialist third-party services.</p>\n<h3 id=\"️-cheaper-easier-scaling\"><a href=\"#%EF%B8%8F-cheaper-easier-scaling\" aria-hidden=\"true\">#</a>⚡️ Cheaper, Easier Scaling</h3>\n<p>When your deployment amounts to a stack of files that can be served anywhere, scaling is a matter of serving those files in more places. CDNs are perfect for this, and often include scaling in all of their plans.</p>\n<h3 id=\"️-better-developer-experience\"><a href=\"#%EF%B8%8F-better-developer-experience\" aria-hidden=\"true\">#</a>⚡️ Better Developer Experience</h3>\n<p>Loose coupling and separation of controls allow for more targeted development and debugging, and the expanding selection of CMS options for site generators remove the need to maintain a separate stack for content and marketing.</p>\n<h2 id=\"best-practices\"><a href=\"#best-practices\" aria-hidden=\"true\">#</a>Best practices</h2>\n<p>When building JAMstack projects, you can really get the most out of the stack if you stick to a few best practices.</p>\n<h3 id=\"entire-project-on-a-cdn\"><a href=\"#entire-project-on-a-cdn\" aria-hidden=\"true\">#</a>Entire Project on a CDN</h3>\n<p>Because JAMstack projects don’t rely on server-side code, they can be distributed instead of living on a single server. Serving directly from a CDN unlocks speeds and performance that can’t be beat. The more of your app you can push to the edge, the better the user experience.</p>\n<h3 id=\"everything-lives-in-git\"><a href=\"#everything-lives-in-git\" aria-hidden=\"true\">#</a>Everything Lives in Git</h3>\n<p>With a JAMstack project, anyone should be able to do a git clone, install any needed dependencies with a standard procedure (like npm install), and be ready to run the full project locally. <strong>No databases to clone, no complex installs.</strong> This reduces contributor friction, and also simplifies staging and testing workflows.</p>\n<h3 id=\"modern-build-tools\"><a href=\"#modern-build-tools\" aria-hidden=\"true\">#</a>Modern Build Tools</h3>\n<p>Take advantage of the world of modern build tools. It can be a jungle to get oriented in and it’s a fast moving space, but you’ll want to be able to use tomorrow’s web standards today without waiting for tomorrow’s browsers. And that currently means Babel, PostCSS, Webpack, and friends.</p>\n<h3 id=\"automated-builds\"><a href=\"#automated-builds\" aria-hidden=\"true\">#</a>Automated Builds</h3>\n<p>Because JAMstack markup is prebuilt, content changes won’t go live until you run another build. Automating this process will save you lots of frustration. You can do this yourself with webhooks, or use a publishing platform that includes the service automatically.</p>\n<h2 id=\"learn-more\"><a href=\"#learn-more\" aria-hidden=\"true\">#</a>Learn more</h2>\n<ul>\n<li>Read more: <a href=\"https://jamstack.org/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://jamstack.org/</a></li>\n<li>Videos: <a href=\"https://jamstack.org/resources/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://jamstack.org/resources</a></li>\n</ul>\n","headings":[{"value":"What is the JAMstack?"}],"subtitles":[{"value":"Benefits","anchor":"#benefits"},{"value":"Best practices","anchor":"#best-practices"},{"value":"Learn more","anchor":"#learn-more"}]}},"context":{}}